#### SlantedOrVerticalColumnType Enumeration

---

|  |
| --- |
| See Also |

This enum class is used for the BuiltInParameter SLANTED\_COLUMN\_TYPE\_PARAM.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum SlantedOrVerticalColumnType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SlantedOrVerticalColumnType ``` |

| Visual C++ |
| --- |
| ``` public enum class SlantedOrVerticalColumnType ``` |

# Members

| Member name | Description |
| --- | --- |
| CT\_Vertical |  |
| CT\_Angle |  |
| CT\_EndPoint |  |

# See Also

Autodesk.Revit.DB Namespace